Page({
  data: {
    rules: [
      {
        title: "如何提出一个好的问题",
        content: "在你开始提问前，请务必确保：\n尝试搜索互联网以找到答案\n尝试从讨论区其他问题中找到答案"
      },
      {
        title: "使用合适的标题进行主题命名",
        content: "请在标题中体现出尽足够多的关键信息。使用主题的好惯例是“对象──偏差”式的描述，比如下面这个例子：\n\n愚蠢的标题：《救命，我的代码怎么不对啊！》\n明智的标题：《E7的G题TLE有什么可能的原因》"
      },
      {
        title: "使用清晰概要的问题描述",
        content: "仔细、清楚地描述问题的症状并不意味着你需要将问题描述写得很多。你应该写得准确且有力，常见的交代内容例如：\n\n问题发生的地方\n提问前做过的研究及其理解"
      },
      {
        title: "鼓励积极交流",
        content: "对于一些搜索引擎可以搜索到的问题的答案，可以对问题再进行比较精简凝练的回答后，再给出链接。\n\n如果自己也不确定，一定要事先说清楚。一个听起来正确的错误回复比没有回复更糟糕。\n\n不要发布无意义的跟帖跟帖、水帖."
      },
      {
        title: "文明发言",
        content: "禁止发布任何违法、辱骂、或恶意信息。我们倡导友好、有益的交流氛围。"
      },
      {
        title: "保护隐私",
        content: "禁止泄露他人隐私信息。请不要在公共讨论中提及他人私密信息。"
      }
    ],
  },
});
